web/WEB-INF/wsdl/localhost_62347/Service1.svc.singlewsdl.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="Service1" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:tns="http://tempuri.org/" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><wsdl:types><xs:schema elementFormDefault="qualified" targetNamespace="http://tempuri.org/" xmlns:xs="http://www.w3.org/2001/XMLSchema"><xs:import namespace="http://schemas.datacontract.org/2004/07/CesfamServicios"/><xs:import namespace="http://schemas.datacontract.org/2004/07/CesfamNegocio"/><xs:element name="GetData"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="value" type="xs:int"/></xs:sequence></xs:complexType></xs:element><xs:element name="GetDataResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="GetDataResult" nillable="true" type="xs:string"/></xs:sequence></xs:complexType></xs:element><xs:element name="GetDataUsingDataContract"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="composite" nillable="true" type="q1:CompositeType" xmlns:q1="http://schemas.datacontract.org/2004/07/CesfamServicios"/></xs:sequence></xs:complexType></xs:element><xs:element name="GetDataUsingDataContractResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="GetDataUsingDataContractResult" nillable="true" type="q2:CompositeType" xmlns:q2="http://schemas.datacontract.org/2004/07/CesfamServicios"/></xs:sequence></xs:complexType></xs:element><xs:element name="ListarPaciente"><xs:complexType><xs:sequence/></xs:complexType></xs:element><xs:element name="ListarPacienteResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="ListarPacienteResult" nillable="true" type="q3:ArrayOfPaciente" xmlns:q3="http://schemas.datacontract.org/2004/07/CesfamNegocio"/></xs:sequence></xs:complexType></xs:element><xs:element name="ListarCategoria"><xs:complexType><xs:sequence/></xs:complexType></xs:element><xs:element name="ListarCategoriaResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="ListarCategoriaResult" nillable="true" type="q4:ArrayOfCategoria" xmlns:q4="http://schemas.datacontract.org/2004/07/CesfamNegocio"/></xs:sequence></xs:complexType></xs:element><xs:element name="productoPorCategoria"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="idCategoriaJava" type="xs:int"/></xs:sequence></xs:complexType></xs:element><xs:element name="productoPorCategoriaResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="productoPorCategoriaResult" nillable="true" type="q5:ArrayOfQuerys" xmlns:q5="http://schemas.datacontract.org/2004/07/CesfamNegocio"/></xs:sequence></xs:complexType></xs:element><xs:element name="verificarUsuario"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="usuario" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="clave" nillable="true" type="xs:string"/></xs:sequence></xs:complexType></xs:element><xs:element name="verificarUsuarioResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="verificarUsuarioResult" type="xs:boolean"/></xs:sequence></xs:complexType></xs:element></xs:schema><xs:schema attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/"><xs:element name="anyType" nillable="true" type="xs:anyType"/><xs:element name="anyURI" nillable="true" type="xs:anyURI"/><xs:element name="base64Binary" nillable="true" type="xs:base64Binary"/><xs:element name="boolean" nillable="true" type="xs:boolean"/><xs:element name="byte" nillable="true" type="xs:byte"/><xs:element name="dateTime" nillable="true" type="xs:dateTime"/><xs:element name="decimal" nillable="true" type="xs:decimal"/><xs:element name="double" nillable="true" type="xs:double"/><xs:element name="float" nillable="true" type="xs:float"/><xs:element name="int" nillable="true" type="xs:int"/><xs:element name="long" nillable="true" type="xs:long"/><xs:element name="QName" nillable="true" type="xs:QName"/><xs:element name="short" nillable="true" type="xs:short"/><xs:element name="string" nillable="true" type="xs:string"/><xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte"/><xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt"/><xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong"/><xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort"/><xs:element name="char" nillable="true" type="tns:char"/><xs:simpleType name="char"><xs:restriction base="xs:int"/></xs:simpleType><xs:element name="duration" nillable="true" type="tns:duration"/><xs:simpleType name="duration"><xs:restriction base="xs:duration"><xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?"/><xs:minInclusive value="-P10675199DT2H48M5.4775808S"/><xs:maxInclusive value="P10675199DT2H48M5.4775807S"/></xs:restriction></xs:simpleType><xs:element name="guid" nillable="true" type="tns:guid"/><xs:simpleType name="guid"><xs:restriction base="xs:string"><xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}"/></xs:restriction></xs:simpleType><xs:attribute name="FactoryType" type="xs:QName"/><xs:attribute name="Id" type="xs:ID"/><xs:attribute name="Ref" type="xs:IDREF"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/CesfamServicios" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.datacontract.org/2004/07/CesfamServicios"><xs:complexType name="CompositeType"><xs:sequence><xs:element minOccurs="0" name="BoolValue" type="xs:boolean"/><xs:element minOccurs="0" name="StringValue" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="CompositeType" nillable="true" type="tns:CompositeType"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/CesfamNegocio" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.datacontract.org/2004/07/CesfamNegocio"><xs:complexType name="ArrayOfPaciente"><xs:sequence><xs:element minOccurs="0" maxOccurs="unbounded" name="Paciente" nillable="true" type="tns:Paciente"/></xs:sequence></xs:complexType><xs:element name="ArrayOfPaciente" nillable="true" type="tns:ArrayOfPaciente"/><xs:complexType name="Paciente"><xs:sequence><xs:element minOccurs="0" name="ApellidoMaterno" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="ApellidoPaterno" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="CodigoLibreta" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Correo" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Direccion" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="FechaNacimiento" type="xs:dateTime"/><xs:element minOccurs="0" name="IdPaciente" type="xs:int"/><xs:element minOccurs="0" name="Nombre" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Rut" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="Paciente" nillable="true" type="tns:Paciente"/><xs:complexType name="ArrayOfCategoria"><xs:sequence><xs:element minOccurs="0" maxOccurs="unbounded" name="Categoria" nillable="true" type="tns:Categoria"/></xs:sequence></xs:complexType><xs:element name="ArrayOfCategoria" nillable="true" type="tns:ArrayOfCategoria"/><xs:complexType name="Categoria"><xs:sequence><xs:element minOccurs="0" name="EstadoCategoria" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="IdCategoria" type="xs:int"/><xs:element minOccurs="0" name="NombreCategoria" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="Categoria" nillable="true" type="tns:Categoria"/><xs:complexType name="ArrayOfQuerys"><xs:sequence><xs:element minOccurs="0" maxOccurs="unbounded" name="Querys" nillable="true" type="tns:Querys"/></xs:sequence></xs:complexType><xs:element name="ArrayOfQuerys" nillable="true" type="tns:ArrayOfQuerys"/><xs:complexType name="Querys"><xs:sequence><xs:element minOccurs="0" name="codigoLibreta" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="fecha" type="xs:dateTime"/><xs:element minOccurs="0" name="idProducto" type="xs:int"/><xs:element minOccurs="0" name="nombre" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="nombreCategoria" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="nombreProducto" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="nombreTutor" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="rut" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="Querys" nillable="true" type="tns:Querys"/></xs:schema></wsdl:types><wsdl:message name="IService1_GetData_InputMessage"><wsdl:part name="parameters" element="tns:GetData"/></wsdl:message><wsdl:message name="IService1_GetData_OutputMessage"><wsdl:part name="parameters" element="tns:GetDataResponse"/></wsdl:message><wsdl:message name="IService1_GetDataUsingDataContract_InputMessage"><wsdl:part name="parameters" element="tns:GetDataUsingDataContract"/></wsdl:message><wsdl:message name="IService1_GetDataUsingDataContract_OutputMessage"><wsdl:part name="parameters" element="tns:GetDataUsingDataContractResponse"/></wsdl:message><wsdl:message name="IService1_ListarPaciente_InputMessage"><wsdl:part name="parameters" element="tns:ListarPaciente"/></wsdl:message><wsdl:message name="IService1_ListarPaciente_OutputMessage"><wsdl:part name="parameters" element="tns:ListarPacienteResponse"/></wsdl:message><wsdl:message name="IService1_ListarCategoria_InputMessage"><wsdl:part name="parameters" element="tns:ListarCategoria"/></wsdl:message><wsdl:message name="IService1_ListarCategoria_OutputMessage"><wsdl:part name="parameters" element="tns:ListarCategoriaResponse"/></wsdl:message><wsdl:message name="IService1_productoPorCategoria_InputMessage"><wsdl:part name="parameters" element="tns:productoPorCategoria"/></wsdl:message><wsdl:message name="IService1_productoPorCategoria_OutputMessage"><wsdl:part name="parameters" element="tns:productoPorCategoriaResponse"/></wsdl:message><wsdl:message name="IService1_verificarUsuario_InputMessage"><wsdl:part name="parameters" element="tns:verificarUsuario"/></wsdl:message><wsdl:message name="IService1_verificarUsuario_OutputMessage"><wsdl:part name="parameters" element="tns:verificarUsuarioResponse"/></wsdl:message><wsdl:portType name="IService1"><wsdl:operation name="GetData"><wsdl:input wsaw:Action="http://tempuri.org/IService1/GetData" message="tns:IService1_GetData_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IService1/GetDataResponse" message="tns:IService1_GetData_OutputMessage"/></wsdl:operation><wsdl:operation name="GetDataUsingDataContract"><wsdl:input wsaw:Action="http://tempuri.org/IService1/GetDataUsingDataContract" message="tns:IService1_GetDataUsingDataContract_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IService1/GetDataUsingDataContractResponse" message="tns:IService1_GetDataUsingDataContract_OutputMessage"/></wsdl:operation><wsdl:operation name="ListarPaciente"><wsdl:input wsaw:Action="http://tempuri.org/IService1/ListarPaciente" message="tns:IService1_ListarPaciente_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IService1/ListarPacienteResponse" message="tns:IService1_ListarPaciente_OutputMessage"/></wsdl:operation><wsdl:operation name="ListarCategoria"><wsdl:input wsaw:Action="http://tempuri.org/IService1/ListarCategoria" message="tns:IService1_ListarCategoria_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IService1/ListarCategoriaResponse" message="tns:IService1_ListarCategoria_OutputMessage"/></wsdl:operation><wsdl:operation name="productoPorCategoria"><wsdl:input wsaw:Action="http://tempuri.org/IService1/productoPorCategoria" message="tns:IService1_productoPorCategoria_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IService1/productoPorCategoriaResponse" message="tns:IService1_productoPorCategoria_OutputMessage"/></wsdl:operation><wsdl:operation name="verificarUsuario"><wsdl:input wsaw:Action="http://tempuri.org/IService1/verificarUsuario" message="tns:IService1_verificarUsuario_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IService1/verificarUsuarioResponse" message="tns:IService1_verificarUsuario_OutputMessage"/></wsdl:operation></wsdl:portType><wsdl:binding name="BasicHttpBinding_IService1" type="tns:IService1"><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="GetData"><soap:operation soapAction="http://tempuri.org/IService1/GetData" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetDataUsingDataContract"><soap:operation soapAction="http://tempuri.org/IService1/GetDataUsingDataContract" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="ListarPaciente"><soap:operation soapAction="http://tempuri.org/IService1/ListarPaciente" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="ListarCategoria"><soap:operation soapAction="http://tempuri.org/IService1/ListarCategoria" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="productoPorCategoria"><soap:operation soapAction="http://tempuri.org/IService1/productoPorCategoria" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="verificarUsuario"><soap:operation soapAction="http://tempuri.org/IService1/verificarUsuario" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="Service1"><wsdl:port name="BasicHttpBinding_IService1" binding="tns:BasicHttpBinding_IService1"><soap:address location="http://localhost:62347/Service1.svc"/></wsdl:port></wsdl:service></wsdl:definitions>